nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gps/gps.c
}


//$GPRMC,063835.00,A,3909.11361,N,11712.50398,E,0.192,150.85,110305,,,A*64
//$GPRMC,063835.00,A,4000.81000,N,11556.40000,E,0.192,150.85,110305,,,A*64

u8 Process_RMC(u8* packet)  
{
	u8  CommaCount=0,iCount=0,k=0; 
	u8  tmpinfo[15]; // 新版本的北斗模块经度更高了
	                          //$GNRMC,085928.00,A,3920.020977,N,11744.385579,E,0.7,,020113,,,A*67
	                          //$GNRMC,090954.00,A,3920.024800,N,11744.384457,E,0.3,,020113,,,A*65
	                          //           11744.385579    
	u8  hour=0,min=0,sec=0,fDateModify=0;

    //----------------------------------------------

    //----------------- Initial Speed and Direction -----------------    
    GPRMC_Funs.Speed(tmpinfo, INIT, k);	
    GPRMC_Funs.Direction(tmpinfo, INIT, k);  	
    //-------------------------------------------------------------------	
 	while (*packet!=0){ 
		if(*packet==','){
			CommaCount++;
			packet++; 
			if(iCount==0) continue; 
			switch(CommaCount){
				case 2: //时间 
				   //systemTickGPS_Set();    
				   if ( iCount < 6 ) 	  //  格式检查
				  {    
				      StatusReg_GPS_V();  
					  return false;
				  }

				    if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[3]>=0x30)&&(tmpinfo[3]<=0x39)&&(tmpinfo[4]>=0x30)&&(tmpinfo[4]<=0x39)&&(tmpinfo[5]>=0x30)&&(tmpinfo[5]<=0x39)) 
				          ;
				   else
					{  StatusReg_GPS_V();   	return false;}

				       
					hour=(tmpinfo[0]-0x30)*10+(tmpinfo[1]-0x30)+8;
					min=(tmpinfo[2]-0x30)*10+(tmpinfo[3]-0x30);
					sec=(tmpinfo[4]-0x30)*10+(tmpinfo[5]-0x30);
					if(hour>23)
					{
						fDateModify=1;
						hour-=24;
						tmpinfo[0]=(hour/10)+'0';
						tmpinfo[1]=(hour%10)+'0';
					}
					//systemTickGPS_Clear();   
					//----------------------------------------------------
					GPRMC_Funs.Time(tmpinfo, hour, min, sec); 
                    //-----------------------------------------------------  
					break;
				case 3://数据有效性
					GPRMC_Funs.Status(tmpinfo);
					break;
				case 4://纬度
					if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[3]>=0x30)&&(tmpinfo[3]<=0x39)&&(tmpinfo[5]>=0x30)&&(tmpinfo[5]<=0x39)&&(tmpinfo[6]>=0x30)&&(tmpinfo[6]<=0x39)&&(tmpinfo[7]>=0x30)&&(tmpinfo[7]<=0x39)&&(tmpinfo[8]>=0x30)&&(tmpinfo[8]<=0x39))
						  ;
					else
						 break; 
					GPRMC_Funs.Latitude(tmpinfo);
					break;
				case 5://纬度半球 
					GPRMC_Funs.Latitude_NS(tmpinfo);  
					break;
				case 6://经度 
				     if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[3]>=0x30)&&(tmpinfo[3]<=0x39)&&(tmpinfo[4]>=0x30)&&(tmpinfo[4]<=0x39)&&(tmpinfo[6]>=0x30)&&(tmpinfo[6]<=0x39)&&(tmpinfo[7]>=0x30)&&(tmpinfo[7]<=0x39)&&(tmpinfo[8]>=0x30)&&(tmpinfo[8]<=0x39)&&(tmpinfo[9]>=0x30)&&(tmpinfo[9]<=0x39))
								;
					else
						break; 
					GPRMC_Funs.Longitude(tmpinfo);
					break;
				case 7://经度半球 
					GPRMC_Funs.Longitude_WE(tmpinfo);
					break;
				case 8://速率 
						   for ( k = 0; k < iCount; k++ )
							{
									if ( tmpinfo[k] == '.' )
									{
											break;
									}
							} 						
							if(k>=iCount)
							{ 
							    rt_kprintf("\r\n K>=icount \r\n");
								//break;
								k=0;
							}
                            GPRMC_Funs.Speed(tmpinfo, PROCESS,k);
							 
					break;
					
				case 9://方向 				    
						   
						   if ( iCount < 3 )			// 格式检查
							{
							    
								 break; 									
							}
						
							for ( k = 0; k < iCount; k++ )
							{
									if ( tmpinfo[k] == '.' )
									{
											break;
									}
							}
						 if(k>=iCount)
							  break;	
						 GPRMC_Funs.Direction(tmpinfo,PROCESS,k);
					break;		
				case 10://日期 
					 if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[3]>=0x30)&&(tmpinfo[3]<=0x39)&&(tmpinfo[4]>=0x30)&&(tmpinfo[4]<=0x39)&&(tmpinfo[5]>=0x30)&&(tmpinfo[5]<=0x39)) 
				          ;
					 else
					 	break;
					  GPRMC_Funs.Date(tmpinfo,fDateModify,hour,min,sec);
					break;
				default:
					break;
			}	
			iCount=0;
		}
		else
		{
			tmpinfo[iCount++]=*packet++;
			if(iCount<15)
			tmpinfo[iCount]=0;
			if(iCount>15)
			{  
			       //  rt_kprintf("\r\n GPS  GPRMC iCounte>12  :  CommaCount=%d  tmpinfo:%15s \r\n",CommaCount,tmpinfo);  
				//return CommaCount;
				break;
			}	
		}
	} 
    //-----------------------------------------------------    
    GPS_Delta_DurPro();   //  用GPS 定时触发  
    //-----------------------------------------------------
	return CommaCount;
} 

//----------------
u8 Process_GSA(u8* packet) 
{

	   return true;
}
//------------------
/*u8 Process_TXT(u8* packet) 
{
 // $GNTXT,01,01,01,ANTENNA SHORT*7D
//$GNTXT,01,01,01,ANTENNA OK*2B
//$GNTXT,01,01,01,ANTENNA OPEN*3B
	
	u8 CommaCount=0,iCount=0;
	u8  tmpinfo[12];
//	float dop;	
	//float Hight1=0,Hight2=0; 
	while (*packet!=0){
		if((*packet==',')||(*packet=='*')){  
			CommaCount++;
			packet++;
			if(iCount==0)	 continue;
			switch(CommaCount){
				case 5:
						if(strncmp((char*)tmpinfo,"ANTENNA OPEN",12)==0)//开路检测	1:天线开路
						{
							 if(OutGPS_Flag==0)
							 {
								   if((Warn_Status[3]&0x20)==0)
									{
									   rt_kprintf("\r\n	检测到	天线开路\r\n");
									    GpsStatus.Antenna_Flag=1;
								           PositionSD_Enable();   
									    Current_UDP_sd=1;	   
								   	}   
								   Warn_Status[3]|=0x20;
								   Warn_Status[3]&=~0x40;	
								  
							}  
						}
						if(strncmp((char*)tmpinfo,"ANTENNA SHORT",13)==0)//短路检测  0:天线短路
						{
						   Warn_Status[3]&=~0x20;
						   Warn_Status[3]|=0x40;
						}
						else
						if(strncmp((char*)tmpinfo,"ANTENNA OK",10)==0)	
						{
						  GpsStatus.Antenna_Flag=0;
						  if(Warn_Status[3]&0x20)
							{
							    rt_kprintf("\r\n	检测到	天线恢复正常");
						           PositionSD_Enable();    
							    Current_UDP_sd=1;	   
						  	}	
						   Warn_Status[3]&=~0x20;
						   Warn_Status[3]&=~0x40;	  						   
						}
				     break;
				default:
					break;
			}
			iCount=0;
		}else{
			tmpinfo[iCount++]=*packet++;
			tmpinfo[iCount]=0;
			if(iCount>12)
				return CommaCount;
		}
	}
	return CommaCount;
   
