nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gps/gps.c
}
*/
//---------------------
u8 Process_GGA(u8* packet)  
{	//检查数据完整性,执行数据转换
	u8 CommaCount=0,iCount=0;
	u8  tmpinfo[12];
	float dop;	
	float Hight1=0,Hight2=0; 
	while (*packet!=0){
		if(*packet==','){
			CommaCount++;
			packet++;
			if(iCount==0)	 
			  { 
			     if(CommaCount==8)
			   	     Satelite_num=0;   
			   	continue;
			   }
			switch(CommaCount){
				case 8:
						        //搜到星的个数$GPGGA,045333,3909.1849,N,11712.3104,E,1,03,4.3,20.9,M,-5.4,M,,*66
						        Satelite_num = ( tmpinfo[0] - 0x30 ) * 10 + ( tmpinfo[1] - 0x30 );
							//	rt_kprintf("\r\n 卫星颗数:%d \r\n",Satelite_num);  
                                                                   //--------- 北斗 卫星颗数  --------------
					                 BD_EXT.FJ_SignalValue=BD_EXT.FJ_SignalValue&0xf0;  // 先清除 GSM 信号位
							   BD_EXT.FJ_SignalValue|=	Satelite_num;  // 低4 位

						        break;             

				case 9:	dop=atof((char *)tmpinfo); 
				        
						HDOP_value=dop;		 //  Hdop 数值	  
				break;
				case 10:// MSL altitude
					Hight1=atof((const char*)tmpinfo);
				break;
				case 12:// Geoid Separation
					Hight2=atof((const char*)tmpinfo);
					GPS_Hight=(u16)(Hight1+Hight2);  	 				
					//printf("\r\n 当前海拔高度为:%f,  %f ,%d m\r\n",Hight1,Hight2,GPS_Hight); 
					break;
				default:
					break;
			}
			iCount=0;
		}else{
			tmpinfo[iCount++]=*packet++;
			tmpinfo[iCount]=0;
			if(iCount>12)
				return CommaCount;
		}
	}
	return CommaCount;


}
//------------------------------------------------------------------
void  GPS_ANTENNA_status(void)     //  天线开短路状态检测 
{
    // 2013-4-20    更改PCB   用PD4 : GPS 天线开路      PB6 : GPS  天线短路
   	if(GPIO_ReadOutputDataBit(GPS_PWR_PORT, GPS_PWR_PIN )) // 在GPS 有电时有效   
		{
			if(GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_4))//开路检测	1:天线开路
			{
				 if(OutGPS_Flag==0)
				 {
					   if((Warn_Status[3]&0x20)==0)
					         rt_kprintf("\r\n	检测到	天线开路"); 
					   Warn_Status[3]|=0x20;
					   Warn_Status[3]&=~0x40; 	 
					   GpsStatus.Antenna_Flag=1;
					   Gps_Exception.GPS_circuit_short_couter=0;
			 	}  
			}
			else if(!GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_6))//短路检测  0:天线短路 
			{
			         if(( Warn_Status[3]&0x40)==0)   
				     {
                        Gps_Exception.GPS_short_keepTimer++;
						if( Gps_Exception.GPS_short_keepTimer>200)     
					    {
					       Gps_Exception.GPS_short_keepTimer=0;  // clear 
					       rt_kprintf("\r\n	检测到	天线短路");     
						   rt_kprintf("\r\n	发现短路，立即断开GPS电源");      
						   GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN ); 


						      //------------------------------------------ 
							  Gps_Exception.GPS_circuit_short_couter++;
							  if(Gps_Exception.GPS_circuit_short_couter>=4)  
							   {
									Gps_Exception.GPS_short_checkFlag=2;
									Gps_Exception.GPS_short_timer=0; // clear  
									rt_kprintf("\r\n   短路检测大于3次 ，一直断开GPS 电源\r\n");   
									
									//	断开 GPS 电源后，得启动 本地定时 ，否则人家说丢包.NND
									/*
							  
									   */ 
							   }	
							  else
							   {
									  Gps_Exception.GPS_short_checkFlag=1; 
							   } 
			                   //-----------------------------------------------------
                             
							   // set  flag 	
							   Warn_Status[3]&=~0x20;
							   Warn_Status[3]|=0x40;	 
							   //------------------------------------------
					     }
			         } 		
				   

			}
			else
			{
				  if(Warn_Status[3]&0x20)
				  	      rt_kprintf("\r\n	检测到	天线恢复正常");   
	              Warn_Status[3]&=~0x20;
				  Warn_Status[3]&=~0x40;   
				  GpsStatus.Antenna_Flag=0;
				  Gps_Exception.GPS_circuit_short_couter=0;
			} 
			
		}
}

void  GPS_short_judge_timer(void)
{
       if(Gps_Exception.GPS_short_checkFlag==1)
       {
        Gps_Exception.GPS_short_timer++; 
		if(Gps_Exception.GPS_short_timer>100)
		{   //   关电 后开启
		     Gps_Exception.GPS_short_timer=0;  
		     gps_onoff(1);
		     rt_kprintf("\r\n	 再次开启GPS模块\r\n"); 
			 //---------------期待模块正常-----------
               Warn_Status[3]&=~0x20;
			   Warn_Status[3]&=~0x40; 
			 //----------------
			 Gps_Exception.GPS_short_checkFlag=0; 
		}	 
 
       }



}

//--------------------------------------------------------------------------------
void  GPS_Rx_Process(u8 * Gps_str ,u16  gps_strLen) 
{    
     u8  Gps_instr[160];  
     u8  GPRMC_Enable=0;	 
	 
	                     memset(Gps_instr,0,sizeof(Gps_instr));     
	                     memcpy(Gps_instr,Gps_str,gps_strLen); 

				if(GpsStatus.Raw_Output==1)		  
		                   rt_kprintf((const char*)Gps_instr);        // rt_kprintf((const char*)Gps_str);         

			   //----------------  Mode  Judge    ---------------------			 
				if(strncmp((char*)Gps_instr,"$GNRMC,",7)==0)
				{	
				     GpsStatus.Position_Moule_Status=3;
				     GPRMC_Enable=1;
				     Car_Status[1]&=~0x0C; // clear bit3 bit2 
				     Car_Status[1]|=0x0C; // BD+GPS  mode	1100	 	 
				}
				if(strncmp((char*)Gps_instr,"$BDRMC,",7)==0)
				{	
				       GpsStatus.Position_Moule_Status=1;
				       GPRMC_Enable=1;
					Car_Status[1]&=~0x0C; // clear bit3 bit2 
					Car_Status[1]|=0x08; // BD mode	1000	   
			        }
				if(strncmp((char*)Gps_instr,"$GPRMC,",7)==0)    
				{	
				       GpsStatus.Position_Moule_Status=2;	
				       GPRMC_Enable=1;
				       Car_Status[1]&=~0x0C; // clear bit3 bit2      1100 
					   Car_Status[1]|=0x04; // Gps mode   0100 
		        }  	 	  
				
                //-------------------------------------------------- 
                            //----------- Pick up useful  --------------------------
			      if(GPRMC_Enable==1) 
			      	{
			      	     if(GpsStatus.Raw_Output==2)	
                                        rt_kprintf(" gps_thread tx :                   %s",Gps_instr);      
					Process_RMC(Gps_instr); 	
					Gps_Exception.current_datacou+=gps_strLen;
                                  return;
			      	}	
			     if((strncmp((char*)Gps_instr,"$GPGGA,",7)==0)||(strncmp((char*)Gps_instr,"$GNGGA,",7)==0)||(strncmp((char*)Gps_instr,"$BDGGA,",7)==0))  
			     {   
					   //GNSS_Trans();
					   Process_GGA(Gps_instr);  
					    return;	
		         }
                if((strncmp((char*)Gps_instr,"$GPGSA,",7)==0)||(strncmp((char*)Gps_instr,"$BDGSA,",7)==0)||(strncmp((char*)Gps_instr,"$GNGSA,",7)==0))
		          {   
					//rt_kprintf("%s",GPSRx);
					//GNSS_Trans();
					Process_GSA(Gps_instr);
				      return;	
			      }
}


