nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/gps/gps.c
		ch_l = 1;
		while( ch_l )
		{
			res = rt_mq_recv( &mq_gps, (void*)&uart_buf, 124, RT_TICK_PER_SECOND * 12 );
			if( res == RT_EOK ) //收到一包数据
			{
				for( ch_h = 0; ch_h < uart_buf.wr; ch_h++ )
				{
					rt_kprintf( "%02x ", uart_buf.body[ch_h] );
				}
				rt_kprintf( "rx tick=%x\r\n",rt_tick_get());
				if( uart_buf.wr == 11 )
				{
					if( uart_buf.body[4] == 0x02 )
					{
						msg( "E升级完成" );
						dev_gps_write( &dev_gps, 0, "\x40\x34\xC0\x00\x34\x00\x01\x84\x6B\x0D\x0A", 11 );
						goto end_upgrade_usb_2;
					}
					sprintf( buf, "I发送第%d包", packet_num );
					msg( buf );
					ch_l = 0;
				}
				
			}else /*超时*/
			{
				msg( "E升级错误" );
				goto end_upgrade_usb_2;
			}
		}
	}

end_upgrade_usb_2:
	rt_thread_resume( &thread_gps );
end_upgrade_usb_1:
	if( fd >= 0 )
	{
		close( fd );
	}
end_upgrade_usb_0:
	rt_free( ptr_mem_packet );
	ptr_mem_packet = RT_NULL;
}

#if 0
/*gps升级*/
rt_err_t gps_upgrade( char *src )
{
	rt_thread_t tid;
	int			buad = 9600;
	rt_kprintf( "\nNow upgrade from %s\n", src );
	if( strncmp( src, "COM", 3 ) == 0 ) /*串口升级*/
	{
		tid = rt_thread_create( "upgrade", thread_gps_upgrade_uart, (void*)msg_uart_usb, 2048, 5, 5 );
		if( tid != RT_NULL )
		{
			rt_thread_startup( tid );
		}else
		{
			rt_kprintf( "\n Upgrade from uart fail\n" );    
		}
	}else
	{
		tid = rt_thread_create( "upgrade", thread_gps_upgrade_udisk, (void*)msg_uart_usb, 512, 7, 5 );
		if( tid != RT_NULL )
		{
			rt_thread_startup( tid );
		}else
		{
			rt_kprintf( "\n Upgrade from uart fail\n" );
		}
	}
}

//FINSH_FUNCTION_EXPORT( gps_upgrade, upgrade bd_gps );  
#endif

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t gps_write( uint8_t *p, uint8_t len )
{
	return dev_gps_write( &dev_gps, 0, p, len );
}

//FINSH_FUNCTION_EXPORT( gps_write, write to gps );



void  gps_mode(u8 *str) 
{
   if (strlen((const char*)str)==0)
	{
		     rt_kprintf("\r\n    定位模式:    ");  
		      switch(GpsStatus.Position_Moule_Status)
		      	{  
		      	         case 1:           rt_kprintf(" BD\r\n");  
						 	break;
				  case 2:           rt_kprintf(" GPS\r\n");  
				  	              break;
				  case 3:           rt_kprintf(" BD+GPS\r\n");  
				  	              break;
		      	}
	}
	else 
	{
		if(str[0]=='1')
			{
			  dev_gps_write( &dev_gps, 0, BD_MODE, strlen((const char*)BD_MODE));
			   GpsStatus.Position_Moule_Status=1;
			//GPS_PutStr(BD_MODE);
			 rt_kprintf ("\r\n    BD MODE\r\n"); 
			}
		else if(str[0]=='2')
			{
			 dev_gps_write( &dev_gps, 0, GPS_MODE, strlen((const char*)BD_MODE));
			  GpsStatus.Position_Moule_Status=2;
			//GPS_PutStr(GPS_MODE);
			   rt_kprintf("\r\n    GPS MODE\r\n");
			}
		else if(str[0]=='3')
			{
			   dev_gps_write( &dev_gps, 0, GPSBD_MODE, strlen((const char*)BD_MODE));    
			   GpsStatus.Position_Moule_Status=3;
			//GPS_PutStr(GPSBD_MODE);
			rt_kprintf("\r\n    GPS&BD MODE\r\n");
			}
	 }
 }
FINSH_FUNCTION_EXPORT(gps_mode, posit_mode setting);


void  gps_raw(u8* str)
{
      if(str[0]=='1')
      	{
      	    GpsStatus.Raw_Output=1;      
      	}
	else  
	if(str[0]=='2')
      	{
      	    GpsStatus.Raw_Output=2;       
      	}  
      else
     if(str[0]=='0') 
     	{
           GpsStatus.Raw_Output=0;         
     	}
     	 
}

FINSH_FUNCTION_EXPORT(gps_raw, gps raw output);  

/************************************** The End Of File **************************************/

